import React from 'react'
import { Row, Layout } from 'flex-layouts'
import { Text } from 'avrs-ui/src/text'

const Confidentiality = () => (
  <Row>
    <Layout basis='20px' />
    <Layout>
      <Text
        size='large'
        color='black400'
      >
        AVERS INTELLIGENCE SYSTEM LTD.
      </Text>
    </Layout>
    <Layout basis='20px' />
    <Layout>
      <Text
        color='black400'
      >
        Политика конфиденциальности
      </Text>
    </Layout>
    <Layout basis='20px' />
    <Layout>
      <Text
        color='black400'
      >
        Введение
      </Text>
    </Layout>
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Реальный акт является общей Политикой конфиденциальности(дальше - “Политика конфиденциальности”)
        фирмы Avers Intelligence Systems Limited, зарегистрированной по адресу: United Kingdom)( дальше - “Фирма”).
        Особые условия относительно продуктов AversIS либо реферальной программы AversIS,
        просьба, смотреть в отдельных документах.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Посещая, используя либо применяя официальный веб-сайт Фирмы по  адресу https://aversistrade.
        com, её продукты, услуги либо сервисы; предоставляя Фирме какую нибудь личную информацию,
        Вы соглашаетесь принять условия подлинной Политики конфиденциальности.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Настоящая политика конфиденциальности не используется, не применяется,
        не относится к услугам либо продуктам, предлагаемым иными компаниями либо физическими лицами,
        включая продукты либо сайты, на какие имеют все шансы ссылаться веб-сайты либо продукты Фирмы.
        Настоящая Политика конфиденциальности не распространяется
        на информационные практики остальных компаний либо организаций,
        какие рекламируют Компанию, её сервисы и продукты.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
      >
        Внедрение информации
      </Text>
    </Layout>
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Собранные не персональные данные употребляются в рекламных целях и
        для снабжения наилучшей работы юзеров на веб-сайтах Фирмы, подсобляют
        Фирмы помогать свойство её услуг, разрешают ей давать общую статистику применении услуг
        Фирмы её деловым партнерам и покупателям. Всевозможные электронные письма и файлы,
        предоставленные Вами Фирме в процессе использования её услугами,
        продуктами либо сообразно электронной почте, числятся конфиденциальной информацией,
        которая защищается Фирмой. Ваши электронные письма и файлы никогда не будут реализовываться,
        покупаться либо предоставляться третьим лицами. Не считая такого, в Англии это считается преступным.
      </Text>
    </Layout>
    <Layout basis='30px' />
  </Row>
)

export default Confidentiality
