/* eslint-disable react/no-unescaped-entities */
/* eslint-disable max-len */
import React from 'react'
import { Row, Layout } from 'flex-layouts'
import { Text } from 'avrs-ui/src/text'

const TermsOfUse = () => (
  <Row>
    <Layout basis='20px' />
    <Layout>
      <Text
        size='large'
        color='black400'
      >
        AVERS INTELLIGENCE SYSTEM LTD.
      </Text>
    </Layout>
    <Layout basis='20px' />
    <Layout>
      <Text
        color='black400'
      >
        Лицензионное соглашение с конечным пользователем
      </Text>
    </Layout>
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        ПРОДУКТА И ПРОГРАМНОГО ОБЕСПЕЧЕНИЯ AVERSIS
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Внимательно прочтите условия данного Соглашения,
        прежде чем продолжить установку продукта.
        В рамках данного соглашения, если содержание не требует иного,
        используются слова и выражения, определенные в разделе 1 настоящего Соглашения.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Настоящее Соглашение, а также его обновления - это соглашение между
        Вами и компанией AVERS INTELLIGENCE SYSTEM LTD.
        на использование Продукта с любого компьютера, на котором данный
        Продукт был установлен Вами лично или третьими лицами.
        Компания AVERS INTELLIGENCE SYSTEM LTD. занимается разработкой программного обеспечения
        и предоставления ресурса вычислительной мощности Вашего персонального компьютера третьим лицам,
        за что обязуется выплачивать вознаграждение.
        Нажав кнопку {'"Далее"'}, {'"Принять"'} или аналогичную кнопку, либо пройдя по соответствующей ссылке,
        и/или используя Продукт, Вы соглашаетесь с условиями настоящего Соглашения.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Ваше соглашение с компанией AVERS INTELLIGENCE SYSTEM LTD.
        также может включать Дополнительные условия (определенные ниже).
        Дополнительные условия включают, но не ограничиваются,
        условиями и положениями, изложенными в настоящем Соглашении.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Для эффективного использования Продукта, его компонентов,
        Программного обеспечения, онлайн-сервисов и Веб-сайта компании AVERS INTELLIGENCE SYSTEM LTD..,
        Вы должны принять соответствующие Дополнительные условия. Вы можете принять Дополнительные условия,
        нажав на кнопку с соответствующей опцией или иным предложенным способом, или использованием Продукта,
        компонентов Продукта, Программного обеспечения, онлайн-сервисов и
        Веб-сайта компании AVERS INTELLIGENCE SYSTEM LTD..,
        при котором Вы подтверждаете и соглашаетесь, что таким использованием Вы принимаете соответствующие условия.
      </Text>
    </Layout>
    <Layout basis='30px' />
    <Layout>
      <Text
        color='black400'
        weight='light'
        lineHeight='large'
      >
        Вы признаете и соглашаетесь, что принимая условия настоящего Соглашения, а также Дополнительные условия, Вы заключаете юридическое соглашение. В случае возникновения каких-либо противоречий между Дополнительными условиями и настоящим Соглашением, Дополнительные условия имеют преимущественную силу в отношении соответствующей Услуги компании AVERS INTELLIGENCE SYSTEM LTD.. Рекомендуем распечатать копию настоящего Соглашения и сохранить ее.
        <br />
        <br />
        Настоящим Вы выражаете свое согласие на использование электронных средств связи с целью заключения контрактов, размещения заказов и создания других записей, а также на электронную доставку уведомлений, регламентирующих документов и данных об операциях, инициированных или совершенных через Продукт.
        <br />
        <br />
        Кроме того, настоящим Вы отказываетесь от принятия на себя любых прав или выполнения любых требований, в соответствии с законами и регулятивными актами в любой юрисдикции, требующих оригинальную, неэлектронную подпись, от доставки или хранения каких бы то ни было неэлектронных записей, в той степени, которая разрешена соответствующим действующим в данной области законом.
        <br />
        <br />
        Если скачивание или использование Продукта запрещено законодательством страны, гражданином которой Вы являетесь, по причине различных требований или полного запрета на использование Продукта в данной стране, не устанавливайте и не используйте его.
        <br />
        <br />
        1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
        <br />
        <br />
        1.1. В рамках данного Соглашения следующие слова и выражения будут иметь следующее значение:
        <br />
        <br />
        Продукт – Приложение AVERSIS (AVERS INTELEGENCE SYSTEM APPLICATION), это приложение, которое клиенты устанавливают для предоставления в аренду свободных вычислительных ресурсов своих персональных компьютеров с целью предоставления данного ресурса третьим лицам. Продукт является частью Программного обеспечения компании AVERSIS. Продукт, помимо его обновлений, улучшений, исправлений и новых версий, состоит из следующих компонентов:
        <br />
        <br />
        -  Приложение AVERSIS - компонент, предназначенный для осуществления передачи вычислительных ресурсов при посредничестве AVERS INTELLIGENCE SYSTEM LTD.
        <br />
        <br />
        -  Вычислительные задачи в системе распределяются в зависимости от приобретенного пакета в системе. А также от рейтинга производительности персональных компьютеров клиентов сети. Рейтинг производительности формируется на основании таких параметров как: вычислительная мощность, объём доступной оперативной памяти, время бездействия и скорость подключения к сети Интернет.
        <br />
        <br />
        Установка Приложения AVERSIS на персональном компьютере Участника является одним из обязательных условий участия в системе AVERSIS для получения вознаграждения в соответствии с приобретенным пакетом.
        <br />
        <br />
        Обращаем внимание на то, что установка Приложения разрешается только на персональных компьютерах Клиента.
        <br />
        <br />
        Приложения AVERSIS активируется строго согласно приобретенному пакету или дополнительному расширению на одном клиентском аккаунте.
        <br />
        <br />
        Работа большого количества Приложений в локальной сети (в том числе виртуальной) противоречит идее AVERS INTELLIGENCE SYSTEM, поскольку нарушает основоположный принцип децентрализации.
        <br />
        <br />
        Максимальное количество различных учётных записей, работающих одновременно в одной локальной сети (под одним внешним IP адресом) не должно превышать 6 (шести).
        <br />
        <br />
        -  Сетевые протоколы - защищенные сетевые протоколы передачи данных предназначенные для взаимодействия Продукта с Программным обеспечением AVERSIS, онлайн-сервисами и Веб-сайтами AVERSIS;
        <br />
        <br />
        -  Интерфейс программы - совокупность средств, при помощи которых конечный пользователь взаимодействует с Продуктом, включающая, но не ограничивающаяся следующими графическими элементами Продукта: кнопка, радиокнопка, флажок/переключатель, значок/иконка, список, дерево, поле редактирования, элемент для отображения табличных данных, меню, окно, вкладка, панель инструментов, полоса прокрутки, ползунок, строка состояния, всплывающая подсказка;
        <br />
        <br />
        -  Документация - любая документация, опубликованная онлайн, либо иным способом предоставленная компанией AVERS INTELLIGENCE SYSTEM LTD., включая, но не ограничиваясь файлами в формате CHM, которые устанавливаются вместе с Продуктом или загружаются во время его использования.
        <br />
        <br />
        Программное обеспечение AVERSIS - вместе с любыми обновлениями, изменениями, модификациями, новыми версиями, и связанные с ней подсистемы, компоненты и сервисы, в том числе, но не ограничиваясь, серверные и клиентские компоненты приложения, соответствующие сетевые протоколы безопасной передачи данных, базы данных, пользовательский интерфейс программного обеспечения, документация, Продукт и его компоненты, а также онлайн-услуги и Веб-сайты AVERSIS, связанные с Программным обеспечением AVERSIS.
        <br />
        <br />
        Соглашение - данное Лицензионное соглашение конечного пользователя, а также его обновленные, измененные и/или дополненные будущие варианты в действующей на соответствующий момент редакции.
        <br />
        <br />
        Дата вступления в силу - дата заключения данного Соглашения посредством нажатия кнопки "Далее", "Принять" или аналогичной кнопки в соответствии с процедурой, описанной выше, либо использование Вами приложения в зависимости от того, что наступит раньше.
        <br />
        <br />
        Дополнительные условия - условия и положения, применимые к использованию Вами Программного обеспечения AVERSIS, Продуктов и Веб-сайта компании AVERS INTELLIGENCE SYSTEM LTD., публикуемые или декларируемые в дополнение к настоящему Соглашению.
        <br />
        <br />
        AVERS INTELLIGENCE SYSTEM LTD - компания по разработке программного обеспечения AVERSIS., зарегистрированная по адресу: Trojan House, Top Floor, 34 Arcadia Avenue, London, United Kingdom, N3 2JU , в соответствии с законодательством United Kingdom.
        <br />
        <br />
        Аффилированные юридические лица - любая корпорация, компании или другие субъекты, прямо или косвенно контролирующие деятельность компании AVERS INTELLIGENCE SYSTEM LTD., находящиеся под контролем компании AVERS INTELLIGENCE SYSTEM LTD. или находящиеся совместно с компанией AVERS INTELLIGENCE SYSTEM LTD. под контролем третьих лиц. В тексте данного документа термины «контролировать» и «иметь контроль над» означают обладать прямо или косвенно более чем 50% (пятьюдесятью процентами) выпущенных в обращение обыкновенных акций корпорации, компании или другого юридического лица.
        <br />
        <br />
        Контент - любой контент, состоящий из текста, звуковых файлов, изображений, фотографий, видео- и/или другой тип информации или коммуникации.
        <br />
        <br />
        Права интеллектуальной собственности - патенты, проекты, торговые марки и коммерческие названия (зарегистрированные и незарегистрированные), авторские и другие аналогичные права, права на базы данных, "ноу-хау" и конфиденциальная информация; все прочие права на интеллектуальную собственность и аналогичные или эквивалентные права в любой точке мира, которые существуют на данный момент или будут признаны в будущем; а также заявки, дополнения и поправки, внесенные в какие-либо из указанных прав.
        <br />
        <br />
        Онлайновые материалы AVERSIS - Контент, доступный для загрузки с Веб-сайта компании AVERS INTELLIGENCE SYSTEM LTD., а также любые изменения Контента, которые компания AVERS INTELLIGENCE SYSTEM LTD. может вносить по своему усмотрению.
        <br />
        <br />
        Рекламные материалы AVERSIS - любые торговые марки, имена, названия, знаки, логотипы, баннеры и любые иные материалы в какой-либо форме, принадлежащие и/или используемые компанией AVERSIS для рекламирования компании, ее продуктов или деятельности.
        <br />
        <br />
        Сотрудники AVERSIS - должностные лица, директора, сотрудники и представители компании AVERSIS или Аффилированных юридических лиц, а также любые другие лица, нанимаемые компанией AVERSIS или ее Аффилированными юридическими лицами.
        <br />
        <br />
        Веб-сайт AVERSIS: все элементы, Контент и стиль (“look and feel”) веб-сайта с URL-адресами www.aversis.net, www.aversis.info (среди прочих URL-адресов), с которого может быть загружено Программное обеспечение компании AVERSIS.
        <br />
        <br />
        Учетная запись - учетная запись с Логином и Паролем, созданная для использования Программного обеспечения AVERSIS.
        <br />
        <br />
        Логин - идентификационный код, который в сочетании с Паролем предоставляет Вам право доступа к Вашей Учетной записи.
        <br />
        <br />
        Пароль - выбранный Вами код, который в сочетании с Логином предоставляет Вам право доступа к Вашей Учетной записи.
        <br />
        <br />
        Вы - вы как пользователь Программного обеспечения AVERSIS (употребляется также в других падежных формах).
        <br />
        <br />
        1.2. Упоминания в единственном числе относятся также и к множественному числу и наоборот, также упоминания одного рода относятся к другим.
        <br />
        <br />
        1.3. Любую фразу, начинающуюся со слов (в любой форме) "включая", "в том числе", "в особенности" и подобных выражений, следует рассматривать как иллюстративную, не ограничивающую смысл предшествующей фразы.
        <br />
        <br />
        2. ЛИЦЕНЗИЯ И ОГРАНИЧЕНИЯ
        <br />
        <br />
        2.1. Лицензия.
        <br />
        <br />
        В соответствии с положениями данного Соглашения, AVERSIS предоставляет Вам ограниченную, персональную, неэксклюзивную, простую, неисключительную, не подлежащую сублицензированию и переуступке, лицензию, дающую Вам право загружать, устанавливать и использовать Продукт исключительно с Программным обеспечением AVERSIS на Вашем персональном компьютере, мобильном телефоне или мобильном компьютере.
        <br />
        <br />
        Данная лицензия не предоставляет Вам право улучшать и обновлять версию и не гарантирует постоянный доступ к Продукту или Программному обеспечению AVERSIS.
        <br />
        <br />
        AVERSIS может пересматривать, изменять, прекращать предоставление, требовать от Вас незамедлительного прекращения использования Продукта, Программного обеспечения AVERSIS, его функциональных возможностей или части вышеперечисленного, результатом чего время от времени может стать без предварительного уведомления потеря совместимости, отказ в предоставлении доступа к функциональным возможностям Программного обеспечения AVERSIS или сети AVERSIS, системе, Веб-сайту AVERSIS, серверам, инструментам, информации и базам данных, прекращение коммерческой деятельности, связанной с вышеперечисленным.
        <br />
        <br />
        2.2. Запрет на предоставление прав третьим лицам.
        <br />
        <br />
        Вы обязуетесь не продавать, не переуступать, не давать в пользование, не распространять, не экспортировать, не импортировать и не передавать иным способом права пользования Продуктом или любым его компонентом третьим лицам.
        <br />
        <br />
        2.3. Запрет на модификации и декомпилирование.
        <br />
        <br />
        Вы обязуетесь не предпринимать и не санкционировать модификаций Продукта, его перевода на другие языки, создания аналогичных продуктов или сервисов на базе Продукта, обратной разработки, декомпилирования и/или обратного ассемблирования Продукта и его компонентов и частей, взлома баз данных, взлома Сетевых протоколов и нарушения целостности защитной системы Продукта и никаким иным образом не изменять программный Интерфейс Продукта. Данное положение остается действительным при аннулировании настоящего Соглашения. Вы также обязуетесь всегда выполнять требования и спецификации в отношении дизайна, использования и презентации Продукта.
        <br />
        <br />
        2.4. Третьи лица.
        <br />
        <br />
        Продукт может включать в себя или являться частью другого программного обеспечения и технологий, принадлежащих или контролируемых третьими лицами. Использование любого программного обеспечения или технологии третьих лиц, включенных в Продукт, регламентируется данным Соглашением.
        <br />
        <br />
        Любое программное обеспечение и технологии третьих лиц, распространяемые вместе с Продуктом, являются объектом прямого лицензионного соглашения между Вами и соответствующими третьими лицами. Вы обязуетесь не вступать в договорные отношения, касающиеся программного обеспечения и технологий третьих лиц, с AVERSIS или Аффилированными юридическими лицами компании, и любые Ваши действия, ставящие своей целью обеспечение соблюдения Ваших прав, должны осуществляться исключительно в отношении соответствующих третьих лиц.
        <br />
        <br />
        2.5. Исключительное право собственности.
        <br />
        <br />
        Вы принимаете к сведению и соглашаетесь с тем, что любые Права интеллектуальной собственности, имеющие отношение к Продукту, Программному обеспечению AVERSIS, Веб-сайту AVERSIS, Онлайновым материалам AVERSIS и Рекламным материалам AVERSIS, принадлежат и будут принадлежать исключительно AVERSIS и/или лицензиарам компании. Никакие из положений данного Соглашения не должны трактоваться как наделяющие Вас такими Правами интеллектуальной собственности.
        <br />
        <br />
        Вы наделяетесь только ограниченным правом пользования объектами Прав интеллектуальной собственности, оговоренными в данном Соглашении. Вы обязуетесь не предпринимать действий, которые могут подвергнуть риску или привести к нарушению или ограничению Прав интеллектуальной собственности. Вы принимаете к сведению и соглашаетесь с тем, что любое несанкционированное использование Прав интеллектуальной собственности является нарушением данного Соглашения, а также нарушением законодательства об интеллектуальной собственности, включая, помимо прочего, законы об авторском праве и законы о товарных знаках.
        <br />
        <br />
        Все права собственности и права Интеллектуальной собственности, в отношении контента, принадлежащего третьим лицам, который не содержится в Программном обеспечении AVERSIS, однако может быть доступным посредством использования Программного обеспечения AVERSIS, принадлежат владельцам такого контента и могут быть защищены соответствующими законами о защите авторских прав и прочими законами об интеллектуальной собственности.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.6. Сохранение уведомлений.
        <br />
        <br />
        Вы обязуетесь не удалять, не скрывать и не видоизменять уведомления и ссылки, относящиеся к правам интеллектуальной собственности, принадлежащим AVERSIS, независимо от того, является ли такое уведомление частью имеющихся материалов или прилагается, или каким-либо иным образом связывается с имеющимися материалами.
        <br />
        <br />
        2.7. Вы соглашаетесь всегда в меру своих сил поддерживать авторитетность и репутацию Программного обеспечения AVERSIS, Продукта, бренда и названия AVERSIS.
        <br />
        <br />
        2.8. Вы обязуетесь не использовать Продукт совместно с каким-либо сторонним  программным обеспечением, которое, по мнению AVERSIS, является фактически или потенциально противозаконным, некорректным или противоречит положениям данного Соглашения или каких-либо Дополнительных условий.
        <br />
        <br />
        2.9. Вы подтверждаете, что услуги или продукты, предоставляемые Вами с использованием Продукта, предоставляются в соответствии с действующим законодательством и нормативными актами (включая, помимо прочего, те из них, которые защищают неприкосновенность частной жизни, конфиденциальность обработки личных данных и данных о трафике).
        <br />
        <br />
        2.10. Вы соглашаетесь с тем, что несете единоличную ответственность (и что AVERSIS не несет никакой ответственности перед Вами или какой-либо третьей стороной) за услуги и/или продукты, предоставляемые Вами с использованием Продукта.
        <br />
        <br />
        2.11. В частности, Вы подтверждаете, что Ваши права на использование Продукта строго зависят от выполнения настоящего Соглашения; любое нарушение положений настоящего Соглашения или соответствующих Дополнительных условий приведет к автоматическому аннулированию соглашения компанией AVERS INTELLIGENCE SYSTEM LTD.
        <br />
        <br />
        2.12. Настоящее Соглашение не наделяет Вас какими-либо правами на использование Рекламных материалов AVERSIS, включая, помимо прочего, торговые знаки и логотипы AVERSIS.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.13. AVERSIS сохраняет за собой право изменять Лицензионное соглашение с конечным пользователем и Дополнительные условия, а также добавлять или удалять какие-либо их части, в любое время по общему или индивидуальному принципу, посредством публикации пересмотренного Соглашения и Дополнительных условий на Веб-сайте AVERSIS либо уведомив Вас об изменениях каким-либо иным образом.  Такие изменения вступают в силу немедленно после публикации. Факт дальнейшего использования Продукта является подтверждением Вашего согласия с условиями и положениями, изложенными в пересмотренных Соглашении с конечным пользователем и Дополнительных условиях.  Вы обязуетесь постоянно следить за Веб-сайтом AVERSIS, чтобы быть уверенными, что Вы в курсе всех изменений в Лицензионном соглашении конечного пользователя и в других соответствующих Дополнительных условиях. В случае Вашего несогласия с любыми изменениями в соответствующих нормативно-правовых документах Вы обязуетесь незамедлительно прекратить любое использование Продукта и, если необходимо, Программного обеспечения AVERSIS.
        <br />
        <br />
        2.14. В отношении Программного обеспечения AVERSIS Вы обязуетесь не проводить обратной разработки, не декомпилировать, не дизассемблировать или иным образом изменять или участвовать в любых других аналогичных манипуляциях с Программным обеспечением AVERSIS либо любой его частью без предварительного письменного согласия AVERSIS и в соответствии с законами United Kingdom. Также Вы обязуетесь не предпринимать и не санкционировать модификаций, перевода на другие языки, создания аналогичных продуктов или сервисов, обратной разработки, декомпилирования и/или обратного ассемблирования Программного обеспечения AVERSIS и его компонентов и частей, взлома баз данных, взлома Сетевых протоколов, нарушения целостности защитной системы Продукта, получения доступа и изменения любых лицензионных сертификатов и никаким иным образом не изменять программный интерфейс.  Вы также обязуетесь всегда выполнять требования и спецификации в отношении дизайна, использования и презентации Программного обеспечения AVERSIS.
        <br />
        <br />
        2.15. Вы принимаете к сведению и соглашаетесь с тем, что Ваше использование Продукта и Программного обеспечения AVERSIS осуществляется на Ваш страх и риск и за Ваш счет. Вы соглашаетесь по первому требованию защищать компанию AVERSIS, ее Аффилированных лиц и Персонал, ограждать их от ответственности и компенсировать их ущерб в связи с любыми имущественными обязательствами и издержками (включая обоснованные юридические расходы), понесенные этими сторонами вследствие или в результате: (а) использования Продукта или Программного обеспечения AVERSIS, (b) любого нарушения условий и положений, содержащихся в данном Соглашении.  Данное положение  остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.16. В случае если Вы хотите использовать Продукт каким-либо образом, отличным от того, который четко изложен в настоящем Соглашении, такое использование однозначно запрещено, если только компания AVERSIS не предоставила Вам соответствующую лицензию в письменной форме.
        <br />
        <br />
        2.17. Права интеллектуальной собственности
        <br />
        <br />
        2.17.1. В том, что касается соглашения между Вами и AVERSIS, AVERSIS и его лицензиары сохраняют за собой все Права интеллектуальной собственности, распространяющиеся на Программное обеспечение AVERSIS (включая Продукт) и любые производные продукты, созданные как непосредственно AVERSIS или лицензиарами компании, так и для AVERSIS и лицензиаров компании.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.17.2. Если Вы являетесь сотрудником или директором компании и используете Продукт от имени своей компании ("Компания"), Вы признаете и соглашаетесь с нижеследующим: (i) принимая данное Соглашение и используя Продукт, Вы подтверждаете, что делаете это от имени и на основании явно выраженного разрешения Компании, основанного на выполнении Вами и Компанией настоящего Соглашения в отношении использования Вами и Компанией Продукта; (ii) лицензия, предоставленная компанией AVERSIS на использование Продукта, предполагает, что Вы получили все необходимые согласия, разрешения и полномочия от Компании официально действовать от имени Компании в соответствии с настоящим Соглашением. Вы заверяете и гарантируете, что получили такие согласия, разрешения и полномочия на использование Продукта от имени Компании. Если у Вас нет таких полномочий, значит, Вы не имеете лицензии на использование Продукта.
        <br />
        <br />
        2.18. Разрешение на использование Вашего компьютера:  Программное обеспечение AVERSIS (включая Продукт) будет использовать ресурсы компьютера, используемого Вами, включая помимо прочего процессор, память и сетевое подключение для обеспечения функциональности Продукта и установления возможностей коммуникации с Программным обеспечением AVERSIS. AVERSIS будет прилагать все оправданные в коммерческом отношении усилия для обеспечения конфиденциальности и целостности Ваших компьютерных ресурсов и передаваемых Вами данных. Тем не менее, Вы принимаете к сведению и соглашаетесь с тем, что AVERSIS не предоставляет какие-либо гарантии в этом отношении.
        <br />
        <br />
        2.19. Обновления и новые версии Продукта и Программного обеспечения AVERSIS.
        <br />
        <br />
        AVERSIS сохраняет за собой право по своему усмотрению добавлять новые функциональные характеристики, программные доработки, улучшения и обновления Продукта и Программного обеспечения AVERSIS. Вы принимаете к сведению и соглашаетесь с тем, что AVERSIS не несет обязательств по предоставлению Вам новых вариантов Продукта и Программного обеспечения AVERSIS.
        <br />
        <br />
        Время от времени Продукт может автоматически скачивать и устанавливать обновления. Такие обновления необходимы для поддержания совместимости программного обеспечения, поддержания безопасности или отладки, или предоставляют новые возможности, функциональность или версии. Вы соглашаетесь получать такие обновления от AVERSIS для продолжения использования Продукта и Программного обеспечения AVERSIS. Вы также даете свое согласие на то, что в случае загрузки, установки и использования нового варианта Продукта или Программного обеспечения AVERSIS от Вас может потребоваться заключение видоизмененного Соглашения.
        <br />
        <br />
        2.20. Временное прекращение пользования: Без судебного вмешательства и с немедленным вступлением таких изменений в силу по своему усмотрению, без предварительного уведомления AVERSIS может изменить, прекратить и приостановить использование Вами Продукта или какого-либо варианта Программного обеспечения AVERSIS или прекратить действие Вашей лицензии, предоставленной в соответствии с настоящим Соглашением, в любое время в случае необходимости устранения неполадок, совершенствования и/или обновления Программного обеспечения AVERSIS, либо по иной веской причине, включая, но не ограничиваясь ситуациями, при которых Вы нарушаете условия, создаете проблемы, влечете своими действиями возможность привлечения к юридической ответственности, принимаете участие в обманных, мошеннических, аморальных или незаконных действиях; или по другой аналогичной причине.
        <br />
        <br />
        2.21. Законность деятельности: Вы обязуетесь использовать Программное обеспечение AVERSIS исключительно в законных целях. В соответствии с этим Вы обязуетесь воздерживаться от (a) прослушивания или вмешательства в любой, не предназначенный для Вас информационный обмен; (b) использования каких-либо программных кодов, предназначенных для искажения, удаления, повреждения или нарушения целостности Программного обеспечения AVERSIS или передаваемой информации; (c) использования или совершения попыток использования Программного обеспечения или Веб-сайтов AVERSIS в нарушение действующего законодательства United Kingdom; (d) использования или распространения любых материалов или контента, на которые третьи лица обладают правом собственности, за исключением случаев, когда у Вас есть лицензия или разрешение лица, обладающего такими правами; (e) модификаций Программного обеспечения AVERSIS, его перевода на другие языки, создания аналогичных продуктов или сервисов на базе Программного обеспечения AVERSIS, обратной разработки, декомпилирования и/или обратного ассемблирования Программного обеспечения AVERSIS и/или его частей, взлома и нарушения целостности баз данных, взлома защищенных сетевых протоколов передачи данных, взлома и нарушения целостности защитной системы Программного обеспечения AVERSIS.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.22. Безопасность Пароля. Для предотвращения несанкционированного использования храните свой пароль в секрете и не сообщайте его третьим лицам.
        <br />
        <br />
        Если Вы предполагаете, что Ваш пароль мог узнать кто-то другой, Вы должны незамедлительно сменить его для защиты конфиденциальности Вашей Учетной записи пользователя.
        <br />
        <br />
        2.23. Продукт использует интернет-соединение для обеспечения собственной функциональности. Все расходы, связанные с использованием сети Интернет при использовании Вами Продукта или Программного обеспечения AVERSIS, оплачиваются Вами.
        <br />
        <br />
        2.24. Заверения. Вы заверяете и гарантируете, что Вы обладаете всеми полномочиями, необходимыми для заключения данного Соглашения и исполнения его требований. Кроме того, Вы подтверждаете и гарантируете, что Вы будете всегда выполнять обязательства, налагаемые на Вас данным Соглашением, а также любыми законами, положениями и нормативными требованиями, которые могут регламентировать использование Программного обеспечения AVERSIS, Продукта и/или Веб-сайта AVERSIS.
        <br />
        <br />
        2.25. ГАРАНТИЯ ЗАЩИТЫ. ВЫ ОБЯЗУЕТЕСЬ ОГРАДИТЬ AVERSIS, АФФИЛИРОВАННЫХ ЛИЦ КОМПАНИИ И ЕЕ СОТРУДНИКОВ ОТ ОТВЕТСТВЕННОСТИ И ГАРАНТИРОВАТЬ ИХ ЗАЩИТУ ОТ ЛЮБЫХ ПРЕТЕНЗИЙ, ТРЕБОВАНИЙ, ДЕЙСТВИЙ, ОБВИНЕНИЙ, УЩЕРБА, ОТВЕТСТВЕННОСТИ, УБЫТКОВ, СУДЕБНЫХ РЕШЕНИЙ, ИЗДЕРЖЕК И РАСХОДОВ, ВКЛЮЧАЯ (НО НЕ ОГРАНИЧИВАЯСЬ) ОБОСНОВАННЫЕ ЮРИДИЧЕСКИЕ РАСХОДЫ, ПОНЕСЕННЫЕ ВЫШЕУКАЗАННЫМИ СТОРОНАМИ, НЕЗАВИСИМО ОТ ТОГО, СВЯЗАНЫ ЛИ ОНИ С ПРЕТЕНЗИЯМИ ТРЕТЬИХ СТОРОН, В РЕЗУЛЬТАТЕ (A) НАРУШЕНИЯ ДАННОГО СОГЛАШЕНИЯ, СООТВЕТСТВУЮЩЕГО ЗАКОНОДАТЕЛЬСТВА, НОРМАТИВНЫХ ТРЕБОВАНИЙ И РУКОВОДСТВ, КАК УКАЗАННЫХ, ТАК И НЕ УКАЗАННЫХ В ДАННОМ ДОКУМЕНТЕ; (B) НАРУШЕНИЯ КАКИХ-ЛИБО ПРАВ ТРЕТЬИХ ЛИЦ; (C) КАК НАДЛЕЖАЩЕГО, ТАК И НЕНАДЛЕЖАЩЕГО ИСПОЛЬЗОВАНИЯ ПРОДУКТА ИЛИ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS; (D) РАСПРОСТРАНЕНИЯ ИНФОРМАЦИИ ПРИ ПОМОЩИ ПРОДУКТА ИЛИ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        2.26. Допускается использование Продукта на территории любой страны, в соответствии с условиями данного Соглашения.
        <br />
        <br />
        2.27. Кроме случаев получения явно выраженного письменного запрета от AVERSIS, Вы обязуетесь не распространять программное приложение в онлайновом режиме через веб-сайт(-ы), который(-е), по мнению AVERSIS, каким-либо образом похож(-и) на Веб-сайт AVERSIS, нарушает(-ют) права интеллектуальной собственности на Веб-сайт AVERSIS или использует(-ют) товарные знаки AVERSIS или слова, описывающие продукцию или услуги AVERSIS, в качестве зарегистрированных адресов URL для того веб-сайта или тех веб-сайтов.
        <br />
        <br />
        2.27.1. Вы подтверждаете, что услуги или продукты, предоставляемые с использованием Вашего программного приложения, предоставляются в соответствии с действующим законодательством и нормативными актами вашей страны (включая, помимо прочего, те из них, которые защищают неприкосновенность частной жизни, конфиденциальность обработки личных данных и данных о трафике).
        <br />
        <br />
        3. СРОКИ, РАСТОРЖЕНИЯ, НОВЫЕ ВАРИАНТЫ
        <br />
        <br />
        3.1. Срок. Данное Соглашение считается действительным с Даты вступления в силу (после его принятия Вами) и остается в силе до момента его расторжения по инициативе любой из сторон в соответствии с нижеследующими положениями. Дополнительные условия считаются действительными с момента принятия Вами данных Дополнительных условий или с начала использования Вами соответствующего продукта и/или сервиса AVERSIS и действуют до момента, когда Вы или AVERSIS принимаете решение прекратить их использование в соответствии с положениями данного документа.
        <br />
        <br />
        3.2. Расторжение. Вы вправе расторгнуть данное Соглашение в любое время. Помимо прочих средств правовой защиты, AVERSIS может ограничить, приостановить или прекратить действие данной лицензии и использование Программного обеспечения AVERSIS, запретить доступ к Веб-сайту AVERSIS, удалить Вашу Учетную запись и/или Логин пользователя, с немедленным вступлением в силу, автоматически и без права оспаривания этого решения в суде, если мы думаем, что Вы нарушаете условия настоящего Соглашения, создаете проблемы, влечете своими действиями возможность привлечения к юридической ответственности, принимаете участие в обманных, мошеннических, аморальных или незаконных действиях или по другой аналогичной причине.
        <br />
        <br />
        3.3. После расторжения Соглашения и Дополнительных условий: (a) все лицензии и права пользования Программным обеспечением будут аннулированы; (b) Вы обязуетесь незамедлительно прекратить любое использование Программного обеспечения AVERSIS; (c) Вы обязуетесь незамедлительно удалить программное обеспечение AVERSIS с жестких дисков всех Ваших персональных компьютеров, серверов и прочих носителей информации и уничтожить все копии программного обеспечения AVERSIS, контролируемые Вами или имеющиеся в Вашем распоряжении.
        <br />
        <br />
        3.4. Новые варианты Соглашения: AVERSIS сохраняет за собой право внесения изменений в данное Соглашение в любое время путем публикации измененного Соглашения на Веб-сайте AVERSIS. Новый вариант Соглашения вступает в силу с даты публикации или принятия Вами пересмотренных условий в прямой форме нажатием кнопки "Далее", "Принять" или аналогичной кнопки, либо пройдя по соответствующей ссылке. Факт дальнейшего использования Вами Продукта является подтверждением Вашего согласия с условиями и положениями нового Соглашения.
        <br />
        <br />
        4. ОТКАЗ ОТ ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ
        <br />
        <br />
        4.1. Отсутствие гарантийных обязательств.  ВЫ СОГЛАСНЫ С ТЕМ, ЧТО AVERSIS НЕ ДАЕТ НИКАКИХ ГАРАНТИЙ, КАСАЮЩИХСЯ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS, КОТОРЫЕ ПРЕДОСТАВЛЯЮТСЯ "КАК ЕСТЬ" БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ; AVERSIS ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ЯВНО УКАЗАННЫХ, ПОДРАЗУМЕВАЕМЫХ ИЛИ ПРЕДУСМОТРЕННЫХ ЗАКОНОМ ГАРАНТИЙ, УСЛОВИЙ ИЛИ ЗАЯВЛЕНИЙ В ОТНОШЕНИИ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS, ВКЛЮЧАЯ (НО НЕ ОГРАНИЧИВАЯСЬ) ЛЮБЫЕ ГАРАНТИИ ИЛИ УСЛОВИЯ КАЧЕСТВА, ПРОИЗВОДИТЕЛЬНОСТИ, НЕНАРУШЕНИЯ ПРАВ, ТОВАРНОГО СОСТОЯНИЯ, А ТАКЖЕ ПРИЕМЛЕМОСТИ ДЛЯ ИСПОЛЬЗОВАНИЯ С КОНКРЕТНОЙ ЦЕЛЬЮ. КРОМЕ ТОГО, AVERSIS НЕ ГАРАНТИРУЕТ ПОСТОЯННУЮ ГОТОВНОСТЬ К РАБОТЕ И ДОСТУПНОСТЬ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS, ЕГО БЕСПЕРЕБОЙНУЮ, СВОЕВРЕМЕННУЮ, ОБЕСПЕЧЕННУЮ ЗАЩИТОЙ, БЕЗОШИБОЧНУЮ РАБОТУ, А ТАКЖЕ СОХРАННОСТЬ, ПОЛНОТУ И БЕЗОШИБОЧНОСТЬ ПЕРЕДАВАЕМОЙ ИНФОРМАЦИИ. AVERSIS НЕ ГАРАНТИРУЕТ НАЛИЧИЯ СОЕДИНЕНИЯ С ИНТЕРНЕТОМ И ПЕРЕДАЧУ ДАННЫХ ЧЕРЕЗ ИНТЕРНЕТ, ОСУЩЕСТВЛЯЕМЫХ ПРИ ПОМОЩИ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS.
        <br />
        <br />
        4.2. Ваш риск: Вы понимаете и соглашаетесь с тем, что Вы принимаете на себя любой риск, являющийся результатом использования Продукта и Программного обеспечения AVERSIS в максимальных пределах, допускаемых соответствующими нормами действующего законодательства.
        <br />
        <br />
        4.3. Отсутствие ответственности: ВЫ ПРИНИМАЕТЕ И СОГЛАШАЕТЕСЬ С ТЕМ, ЧТО AVERSIS, АФФИЛИРОВАННЫЕ ЮРИДИЧЕСКИЕ ЛИЦА КОМПАНИИ, ЛИЦЕНЗИАРЫ КОМПАНИИ И ЕЕ СОТРУДНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО ПОСЛЕДСТВИЯ ВАШЕГО ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS, В СООТВЕТСТВИИ СО СЛЕДУЮЩИМ ПОЛОЖЕНИЕМ ДАННОГО ДОКУМЕНТА. ВАШИМ ЕДИНСТВЕННЫМ СРЕДСТВОМ ПРАВОВОЙ ЗАЩИТЫ В УСЛОВИЯХ ВОЗНИКНОВЕНИЯ ПРОБЛЕМ ИЛИ НЕУДОВЛЕТВОРИТЕЛЬНОГО ФУНКЦИОНИРОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS ЯВЛЯЕТСЯ НЕЗАМЕДЛИТЕЛЬНОЕ УДАЛЕНИЕ И ОТКАЗ ОТ ЕГО ПОСЛЕДУЮЩЕГО ИСПОЛЬЗОВАНИЯ.
        <br />
        <br />
        4.4. Ограничение ответственности. AVERSIS, АФФИЛИРОВАННЫЕ ЮРИДИЧЕСКИЕ ЛИЦА КОМПАНИИ, ЛИЦЕНЗИАРЫ КОМПАНИИ И ЕЕ СОТРУДНИКИ НЕ НЕСУТ КОНТРАКТНОЙ, ГАРАНТИЙНОЙ, ИЛИ ГРАЖДАНСКО-ПРАВОВОЙ (НАПРИМЕР, ЗА ХАЛАТНОСТЬ) ОТВЕТСТВЕННОСТИ, ОТВЕТСТВЕННОСТИ ЗА КАЧЕСТВО И БЕЗОПАСНОСТЬ ПРОДУКТА ИЛИ ЛЮБОЙ ДРУГОЙ ОТВЕТСТВЕННОСТИ:
        <br />
        <br />
        4.4.1. ЗА ЛЮБОЙ ПРЯМОЙ, ПОБОЧНЫЙ, ОСОБЫЙ, КОСВЕННЫЙ ИЛИ СЛУЧАЙНЫЙ УЩЕРБ (ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ПОТЕРЮ ДАННЫХ, СБОИ, ОТКАЗЫ В РАБОТЕ КОМПЬЮТЕРА И ДЕНЕЖНЫЕ УБЫТКИ), ЯВЛЯЮЩИЙСЯ СЛЕДСТВИЕМ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS;
        <br />
        <br />
        4.4.2. ЗА ЛЮБУЮ ПОТЕРЮ ДОХОДА, БИЗНЕСА ИЛИ ПРИБЫЛИ (КАК ПРЯМЫХ, ТАК И КОСВЕННЫХ), ЯВЛЯЮЩИХСЯ СЛЕДСТВИЕМ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS;
        <br />
        <br />
        4.4.3. ЗА ЛЮБОЙ УЩЕРБ ИЛИ УБЫТКИ, ЯВЛЯЮЩИЕСЯ РЕЗУЛЬТАТОМ ИЛИ СВЯЗАННЫЕ С:
        <br />
        <br />
        (I) ЛЮБЫМИ СБОЯМИ ИЛИ ЗАДЕРЖКАМИ В ПЕРЕДАЧЕ ИНФОРМАЦИИ ПРИ ИСПОЛЬЗОВАНИИ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS;
        <br />
        <br />
        (II) ВРЕМЕННЫМ ИЛИ ОКОНЧАТЕЛЬНЫМ ПРЕКРАЩЕНИЕМ ВАМИ ИЛИ AVERSIS ДЕЙСТВИЯ ДАННОГО СОГЛАШЕНИЯ ПО ЛЮБОЙ ПРИЧИНЕ;
        <br />
        <br />
        (III) ВЫПУСКОМ НОВЫХ ВЕРСИЙ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS ИЛИ РЕШЕНИЕМ О НЕПРЕДОСТАВЛЕНИИ ВАМ НОВЫХ ВЕРСИЙ ПРОДУКТА И ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ AVERSIS.
        <br />
        <br />
        Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        4.5. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ AVERSIS, УКАЗАННОЕ В ПАРАГРАФЕ 4.4, ПРИМЕНИМО НЕЗАВИСИМО ОТ ТОГО, БЫЛА ЛИ ВОЗМОЖНОСТЬ ПРЕДВИДЕТЬ НАСТУПЛЕНИЕ ТАКОГО УЩЕРБА ИЛИ УБЫТКОВ.  Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        4.6. В ТОЙ МЕРЕ, ЧТО НЕ ЗАПРЕЩЕНА ЗАКОНОМ, НИ В КАКОМ СЛУЧАЕ AVERSIS  НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ТРАВМЫ, СМЕРТЬ, СЛУЧАЙНЫЕ ИЛИ ПРЯМЫЕ УБЫТКИ НЕЗАВИСИМО ОТ ТЕОРИИ ОТВЕТСТВЕННОСТИ (КОНТРАКТНОЙ, ГРАЖДАНСКО-ПРАВОВОЙ ИЛИ ИНОЙ).
        <br />
        <br />
        4.7. Ограничения юрисдикции. Некоторые запреты и ограничения, указанные выше, не имеют юридической силы на территории определенных юрисдикций, такие запреты и ограничения могут не относиться к Вам. В таких случаях ответственность ограничивается настолько, насколько это допускается соответствующим законодательством. Данное положение остается действительным при аннулировании настоящего Соглашения.
        <br />
        <br />
        5. ПРОЧЕЕ
        <br />
        <br />
        5.1. Данное соглашение в целом. Условия данного Соглашения образуют настоящее соглашение в целом, регулирующее описанные в данном документе отношения между Вами и AVERSIS в отношении Продукта и Программного обеспечения AVERSIS, и лишают юридической силы и заменяют собой все предыдущие договоренности и соглашения, регулирующие данные отношения, если они не были оформлены отдельным документом и заключены в письменной форме. Данный пункт не ограничивает и не освобождает от ответственности за мошенничество или намеренное введение в заблуждение.
        <br />
        <br />
        5.2. Частичная недействительность. Если суд или административный орган компетентной юрисдикции посчитает какое-либо из положений настоящего Соглашения или какую-либо часть положения незаконной, недействительной или лишенной исковой силы, а положение (или его часть) не является неотъемлемой частью Соглашения в целом, законность, действительность и исковая сила остальных положений настоящего Соглашения (включая остальную часть условий, содержащих соответствующее положение) сохраняют полную юридическую силу.
        <br />
        <br />
        5.3. Сохранение права на обеспечение выполнения обязательств. Невозможность воспользоваться или задержка в предоставлении возможности воспользоваться правом, полномочиями или средствами правовой защиты, предоставляемыми данным Соглашением или действующим законодательством, не лишают Вас прав, полномочий или средств правовой защиты, а также не препятствуют и не ограничивают возможность осуществления данного или любого другого права или средства правовой защиты в будущем.
        <br />
        <br />
        5.4. Нормы применяемого права и судебная юрисдикция. Настоящее Соглашение должно регламентироваться и интерпретироваться в соответствии с законодательством United Kingdom. Любые юридические действия или судебные разбирательства, возникающие в рамках настоящего Соглашения, подлежат юрисдикции судов United Kingdom.
        <br />
        <br />
        5.5. Язык. Исходный вариант настоящего Соглашения, составленного на английском языке, может быть переведен на другие языки.  В случае расхождения или противоречия между английским текстом Соглашения и его переводами на другие языки английский текст документа будет иметь преимущественную силу над всеми прочими текстами.
        <br />
        <br />
        5.6. Продолжительность действия Соглашения. Положения статей 2.3 и 2.5, а также все другие положения статей настоящего Соглашения, действие которых, согласно договору, должно сохраняться или продолжаться в случае аннулирования, остаются действительными при аннулировании по любым причинам настоящего Соглашения.
        <br />
        <br />
        ВЫ ПОДТВЕРЖДАЕТЕ, ЧТО ОЗНАКОМИЛИСЬ С НАСТОЯЩИМ СОГЛАШЕНИЕМ И ПОНИМАЕТЕ СВОИ ПРАВА И ОБЯЗАННОСТИ, А ТАКЖЕ УСЛОВИЯ И ПОЛОЖЕНИЯ, СОДЕРЖАЩИЕСЯ В ДАННОМ ДОКУМЕНТЕ. НАЖАВ КНОПКУ "ДАЛЕЕ" или "ПРИНЯТЬ" И (ИЛИ) ПРОДОЛЖИВ УСТАНОВКУ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИСПОЛЬЗУЯ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ AVERSIS, ВЫ ТЕМ САМЫМ ДАЕТЕ БЕЗОГОВОРОЧНОЕ СОГЛАСИЕ НА ВЫПОЛНЕНИЕ УСЛОВИЙ И ПОЛОЖЕНИЙ ДАННОГО ДОКУМЕНТА И ПРЕДОСТАВЛЯЕТЕ AVERSIS ПРАВА, ИЗЛОЖЕННЫЕ В НЕМ.
        <br />
        <br />
        © 2016, AVERS INTELLIGENCE SYSTEM LTD.
      </Text>
    </Layout>
    <Layout basis='30px' />
  </Row>
)

export default TermsOfUse
